# Pandas ===> it is an open source library that is used for handle data manipulations

In [2]:
# data structure 
# 1. Series 
# 2. Dataframes

In [3]:
import pandas as pd

In [4]:
a = pd.Series([1,2,3,4])

In [5]:
a

0    1
1    2
2    3
3    4
dtype: int64

In [6]:
type(a)

pandas.core.series.Series

In [8]:
a ={
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" : ['Happy','Mitali','Shiv','Div','Him','Lucky','Gaurav','Lovly'],
    "DEpartment" : ['HR','HR','Operations','IT','IT','Operation','HR','IT'],
    "Working_hours" : [9,8,8,6,7,8,6,9]
}

In [9]:
type(a)

dict

In [10]:
df = pd.DataFrame(a)

In [11]:
df

   Emp_ID    Name  DEpartment  Working_hours
0       1   Happy          HR              9
1       2  Mitali          HR              8
2       3    Shiv  Operations              8
3       4     Div          IT              6
4       5     Him          IT              7
5       6   Lucky   Operation              8
6       7  Gaurav          HR              6
7       8   Lovly          IT              9

In [12]:
df.columns #returns columns

Index(['Emp_ID', 'Name', 'DEpartment', 'Working_hours'], dtype='object')

In [13]:
df.head() #top 5 data

   Emp_ID    Name  DEpartment  Working_hours
0       1   Happy          HR              9
1       2  Mitali          HR              8
2       3    Shiv  Operations              8
3       4     Div          IT              6
4       5     Him          IT              7

In [14]:
df.head(3) # top 3 data

   Emp_ID    Name  DEpartment  Working_hours
0       1   Happy          HR              9
1       2  Mitali          HR              8
2       3    Shiv  Operations              8

In [15]:
df.tail() #last 5 data

   Emp_ID    Name DEpartment  Working_hours
3       4     Div         IT              6
4       5     Him         IT              7
5       6   Lucky  Operation              8
6       7  Gaurav         HR              6
7       8   Lovly         IT              9

In [16]:
df.tail(3) #last 3 data

   Emp_ID    Name DEpartment  Working_hours
5       6   Lucky  Operation              8
6       7  Gaurav         HR              6
7       8   Lovly         IT              9

In [17]:
df.sample(4) #random index rows

   Emp_ID    Name  DEpartment  Working_hours
6       7  Gaurav          HR              6
3       4     Div          IT              6
2       3    Shiv  Operations              8
5       6   Lucky   Operation              8

In [18]:
df.describe() ##statically view of the data

        Emp_ID  Working_hours
count  8.00000       8.000000
mean   4.50000       7.625000
std    2.44949       1.187735
min    1.00000       6.000000
25%    2.75000       6.750000
50%    4.50000       8.000000
75%    6.25000       8.250000
max    8.00000       9.000000

In [20]:
df.info() #total information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp_ID         8 non-null      int64
 1   Name           8 non-null      object
 2   DEpartment     8 non-null      object
 3   Working_hours  8 non-null      int64
dtypes: int64(2), object(2)
memory usage: 384.0+ bytes

In [22]:
df.to_csv("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\Emp_info.csv",index=False) #export in csv

In [24]:
df.to_excel("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\Excel_Emp_info.xlsx",index=False) #export in excel

In [25]:
df = pd.read_csv("C:\\Users\\raths\\OneDrive\\AppData\\Desktop\\Mitali\\Emp_info.csv") # read csv file

In [26]:
df

   Emp_ID    Name  DEpartment  Working_hours
0       1   Happy          HR              9
1       2  Mitali          HR              8
2       3    Shiv  Operations              8
3       4     Div          IT              6
4       5     Him          IT              7
5       6   Lucky   Operation              8
6       7  Gaurav          HR              6
7       8   Lovly          IT              9

In [27]:
df.head()

   Emp_ID    Name  DEpartment  Working_hours
0       1   Happy          HR              9
1       2  Mitali          HR              8
2       3    Shiv  Operations              8
3       4     Div          IT              6
4       5     Him          IT              7

In [29]:
df['DEpartment'].value_counts() #count the unique values frequency

HR            3
IT            3
Operations    1
Operation     1
Name: DEpartment, dtype: int64

In [30]:
a ={
    "Emp_ID" : [1,2,3,4,5,6,7,8],
    "Name" : ['Happy','Mitali','Shiv','Div','Him','Lucky','Gaurav','Lovly'],
    "DEpartment" : ['HR','HR','Operations','IT','IT','Operation','HR','IT'],
    "Working_hours" : [9,8,8,6,7,8,6,9]
}

In [32]:
df = pd.DataFrame(a)

In [33]:
df['Name'][0]

'Happy'

In [34]:
df['Name'][0] = 'Happuda'

C:\Users\raths\AppData\Local\Temp\ipykernel_13332\3327046139.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Name'][0] = 'Happuda'

In [37]:
df['Working_hours'][3] = 7

C:\Users\raths\AppData\Local\Temp\ipykernel_13332\1867006718.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Working_hours'][3] = 7

In [38]:
df

   Emp_ID     Name  DEpartment  Working_hours
0       1  Happuda          HR              9
1       2   Mitali          HR              8
2       3     Shiv  Operations              8
3       4      Div          IT              7
4       5      Him          IT              7
5       6    Lucky   Operation              8
6       7   Gaurav          HR              6
7       8    Lovly          IT              9

In [39]:
# loc and iloc

# df.loc['row_range','column_name']
# df.iloc['row_range',column_range]

In [40]:
df.loc[2]

Emp_ID                    3
Name                   Shiv
DEpartment       Operations
Working_hours             8
Name: 2, dtype: object

In [41]:
df.loc[2,'Name']

'Shiv'

In [42]:
df.loc[2:5,['Name','DEpartment']]

    Name  DEpartment
2   Shiv  Operations
3    Div          IT
4    Him          IT
5  Lucky   Operation

In [45]:
df.iloc[2,2]

'Operations'

In [47]:
df.iloc[2:4,2:]

   DEpartment  Working_hours
2  Operations              8
3          IT              7

In [49]:
df.isnull() #return the false we null not there otherwise true

   Emp_ID   Name  DEpartment  Working_hours
0   False  False       False          False
1   False  False       False          False
2   False  False       False          False
3   False  False       False          False
4   False  False       False          False
5   False  False       False          False
6   False  False       False          False
7   False  False       False          False

In [51]:
df.isnull().sum() #sum of the null values

Emp_ID           0
Name             0
DEpartment       0
Working_hours    0
dtype: int64

In [53]:
 df.dropna() #remove the row which have null values

   Emp_ID     Name  DEpartment  Working_hours
0       1  Happuda          HR              9
1       2   Mitali          HR              8
2       3     Shiv  Operations              8
3       4      Div          IT              7
4       5      Him          IT              7
5       6    Lucky   Operation              8
6       7   Gaurav          HR              6
7       8    Lovly          IT              9